# Getting Started with pandas

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,-5,3], index=['c','d','a','b'])
for i in obj2.index:
    print(i, obj2[i])

c 4
d 7
a -5
b 3

In [6]:
obj2['c']

4

In [7]:
obj2[['d','a']]

d    7
a   -5
dtype: int64

In [8]:
obj2[obj2>=4]

c    4
d    7
dtype: int64

In [9]:
obj2 * 2

c     8
d    14
a   -10
b     6
dtype: int64

In [10]:
import numpy as np
np.exp(obj2)

c      54.598150
d    1096.633158
a       0.006738
b      20.085537
dtype: float64

In [11]:
kk = np.exp(obj2)
print(type(kk))

<class 'pandas.core.series.Series'>

In [12]:
'd' in obj2

True

In [13]:
sdata= {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [21]:
obj4.name = 'City'
obj4.index.name = 'Population'

In [22]:
obj4

Population
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: City, dtype: float64

In [23]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [25]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [26]:
import pandas as pd

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [29]:
pd.DataFrame(data, columns=['year','state','pop']) # in this order

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                           index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2.dtypes

year       int64
state     object
pop      float64
debt      object
dtype: object

In [33]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [34]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [36]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [37]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [38]:
frame2.pop # ¿porqué?

<bound method DataFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

frame2

In [39]:
print(frame2)
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [40]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [42]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
kk=pd.Series([1,2,3,4])
kk.name='kk1'
kk

0    1
1    2
2    3
3    4
Name: kk1, dtype: int64

In [44]:
frame2['debt'] = 19.69
frame2.loc['three']

year      2002
state     Ohio
pop        3.6
debt     19.69
Name: three, dtype: object

In [45]:
frame2

       year   state  pop   debt
one    2000    Ohio  1.5  19.69
two    2001    Ohio  1.7  19.69
three  2002    Ohio  3.6  19.69
four   2001  Nevada  2.4  19.69
five   2002  Nevada  2.9  19.69
six    2003  Nevada  3.2  19.69

In [46]:
import numpy as np
frame2.debt = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [47]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [48]:
frame2['easter'] = frame2.state == 'Ohio'

In [49]:
frame2

       year   state  pop  debt  easter
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False
six    2003  Nevada  3.2   NaN   False

In [50]:
del frame2['easter']

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
pop = {'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},        
       'Nevada': {2001: 2.4, 2002: 2.9}}
pop

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [54]:
frame3 = pd.DataFrame(pop)
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [55]:
frame3.T[2002]

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [56]:
pop

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [57]:
frame4 = pd.DataFrame(pop, index=[2000, 2001, 2002])

In [58]:
frame4.dtypes

Ohio      float64
Nevada    float64
dtype: object

In [59]:
frame4.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [60]:
display(frame3)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [61]:
 frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [62]:
frame3.index.name = 'year'
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [63]:
frame3

      Ohio  Nevada
year
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [64]:
frame3.columns.name = "state"
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [65]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [67]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

## Index Objects

In [68]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [69]:
# index[2] = "d" # gives an error. Index is inmutable

In [70]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [71]:
obj2 = pd.Series([2.4,5.6,1.5], index=labels)
obj2

0    2.4
1    5.6
2    1.5
dtype: float64

In [72]:
obj2.index is labels

True

In [73]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [74]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [75]:
'Ohio' in frame3.columns

True

In [76]:
2002 in frame3.index

True

In [77]:
2003 in frame3.index

False

In [78]:
'2002' in frame3.index

False

In [79]:
2000+2 in frame3.index

True

In [80]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Essential Functionality

## Redindexing

In [81]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [82]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [83]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3)

0      blue
2    purple
4    yellow
dtype: object

In [84]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [85]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [86]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [87]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [88]:
frame.loc[['a', 'c', 'd'], ['Texas', 'California']]

   Texas  California
a      1           2
c      4           5
d      7           8

In [89]:
frame.loc[['a', 'c'], ['Texas', 'California']]

   Texas  California
a      1           2
c      4           5

In [90]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

## Dropping Entries from an Axis

In [91]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [92]:
obj.name = "numeros"

In [93]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
Name: numeros, dtype: float64

In [94]:
obj.drop('e')

a    0.0
b    1.0
c    2.0
d    3.0
Name: numeros, dtype: float64

In [95]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
Name: numeros, dtype: float64

In [96]:
obj.drop(['d','e'])

a    0.0
b    1.0
c    2.0
Name: numeros, dtype: float64

In [97]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [98]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.drop("Utah")

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [100]:
data.drop(["New York", "Utah"])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [101]:
data.drop(["New York", "Colorado"], axis="index") # axis="columns"

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [102]:
data.drop(["New York", "Colorado"], axis=0)

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [103]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [104]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
Name: numeros, dtype: float64

In [105]:
obj.drop('c', inplace=True)

In [106]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
Name: numeros, dtype: float64

## Index, Selection and Filtering

In [107]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [108]:
obj[1]

1.0

In [109]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [110]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [111]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [112]:
obj[obj>=2]

c    2.0
d    3.0
dtype: float64

In [113]:
obj.loc[['b', 'a', 'd']] # for labels, better use loc

b    1.0
a    0.0
d    3.0
dtype: float64

In [114]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj1

2    1
0    2
1    3
dtype: int64

In [115]:
obj2 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
obj2

a    1
b    2
c    3
dtype: int64

In [116]:
obj1[[0, 1, 2]] # etiquetas

0    2
1    3
2    1
dtype: int64

In [117]:
obj2[[0, 1, 2]] # orden

a    1
b    2
c    3
dtype: int64

In [118]:
obj1.loc[[0, 1, 2]] # etiqueta

0    2
1    3
2    1
dtype: int64

In [119]:
obj1.iloc[[0, 1, 2]] # orden

2    1
0    2
1    3
dtype: int64

In [120]:
obj2.iloc[[0,1,2]] # orden

a    1
b    2
c    3
dtype: int64

In [121]:
obj2[[0,1,2]] # orden

a    1
b    2
c    3
dtype: int64

In [122]:
# obj2.loc[[0, 1, 2]] # falla, loc con labels q. no son int

In [123]:
obj2.loc[['a','b','c']] # etiquetas

a    1
b    2
c    3
dtype: int64

In [124]:
obj2

a    1
b    2
c    3
dtype: int64

In [125]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [126]:
obj.loc['b':'c'] # etiquetas. Ojo last now inclusive. Ojo, no array en array

b    1.0
c    2.0
dtype: float64

In [127]:
obj2.loc['b':'c']

b    2
c    3
dtype: int64

In [128]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [129]:
obj.loc['b':'c'] = 55
obj

a     0.0
b    55.0
c    55.0
d     3.0
dtype: float64

In [130]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
           index=['Ohio', 'Colorado', 'Utah', 'New York'],
           columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [132]:
data[["three","two"]]

          three  two
Ohio          2    1
Colorado      6    5
Utah         10    9
New York     14   13

In [133]:
data[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data[data["three"]<=5]

      one  two  three  four
Ohio    0    1      2     3

In [136]:
data[:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [138]:
data[data<5] = 666
data

          one  two  three  four
Ohio      666  666    666   666
Colorado  666    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

###  Selection on DataFrame with loc and iloc

In [139]:
data

          one  two  three  four
Ohio      666  666    666   666
Colorado  666    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [140]:
type(data.loc['Colorado', ['four','two']])

pandas.core.series.Series

In [141]:
type(data)

pandas.core.frame.DataFrame

In [142]:
type(data.loc['Colorado'])

pandas.core.series.Series

In [143]:
type(data.loc['Colorado':])

pandas.core.frame.DataFrame

In [144]:
data.loc['Colorado':]

          one  two  three  four
Colorado  666    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.loc['Colorado', ['four','two']]

four    7
two     5
Name: Colorado, dtype: int64

In [146]:
data.iloc[1, [3,1]] # orden

four    7
two     5
Name: Colorado, dtype: int64

In [147]:
data.iloc[2] # orden

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [148]:
data.iloc[[1, 2], [3, 0, 1]] # orden

          four  one  two
Colorado     7  666    5
Utah        11    8    9

In [149]:
data

          one  two  three  four
Ohio      666  666    666   666
Colorado  666    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [150]:
data.loc[:'Utah', 'two']

Ohio        666
Colorado      5
Utah          9
Name: two, dtype: int64

In [151]:
data.iloc[:, :3]

          one  two  three
Ohio      666  666    666
Colorado  666    5      6
Utah        8    9     10
New York   12   13     14

In [152]:
data.iloc[:, :3][data.three > 9]

          one  two  three
Ohio      666  666    666
Utah        8    9     10
New York   12   13     14

In [153]:
data.iloc[:, :3]

          one  two  three
Ohio      666  666    666
Colorado  666    5      6
Utah        8    9     10
New York   12   13     14

## Integer Indexing Pitfalls

In [154]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [155]:
# ser[-1] # Error
i = ser.index[-1]
print(ser[i])
print(ser[1:])

2.0
1    1.0
2    2.0
dtype: float64

In [156]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

## Arithmetic and Data Alignment

In [157]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [158]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=[ 'Texitas', 'Ohio', 'Colorado'])
df1

            b    c    d
Texitas   0.0  1.0  2.0
Ohio      3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [159]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [160]:
df1 + df2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio      6.0 NaN  9.0 NaN
Oregon    NaN NaN  NaN NaN
Texas     NaN NaN  NaN NaN
Texitas   NaN NaN  NaN NaN
Utah      NaN NaN  NaN NaN

In [161]:
display(df1)
display(df2)
df1.add(df2, fill_value=1000) # a la que falta lo inicializa a 1000
                              # Si falla en las df1.col y df2.col lo deja en NaN

            b    c    d
Texitas   0.0  1.0  2.0
Ohio      3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

               b       c       d       e
Colorado  1006.0  1007.0  1008.0     NaN
Ohio         6.0  1004.0     9.0  1005.0
Oregon    1009.0     NaN  1010.0  1011.0
Texas     1006.0     NaN  1007.0  1008.0
Texitas   1000.0  1001.0  1002.0     NaN
Utah      1000.0     NaN  1001.0  1002.0

In [162]:
df1.add(df2, fill_value=0) #  a la que falta lo inicializa a 1000
                           # Si falla en las df1.col y df2.col lo deja en NaN

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      6.0  4.0   9.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     6.0  NaN   7.0   8.0
Texitas   0.0  1.0   2.0   NaN
Utah      0.0  NaN   1.0   2.0

In [163]:
df3 = pd.DataFrame(np.arange(4.).reshape(2,2), columns=list('uy'), index=[ 'Tex1', 'Tex2'])
df3

        u    y
Tex1  0.0  1.0
Tex2  2.0  3.0

In [164]:
df1 + df3

           b   c   d   u   y
Colorado NaN NaN NaN NaN NaN
Ohio     NaN NaN NaN NaN NaN
Tex1     NaN NaN NaN NaN NaN
Tex2     NaN NaN NaN NaN NaN
Texitas  NaN NaN NaN NaN NaN

### Arithmetic methods with fill values

In [165]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [166]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [167]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [168]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [169]:
display(df1)
display(df2)
display(df1.add(df2, fill_value=0))

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [170]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [171]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [172]:
df1.rdiv(2)

      a         b         c         d
0   inf  2.000000  1.000000  0.666667
1  0.50  0.400000  0.333333  0.285714
2  0.25  0.222222  0.200000  0.181818

In [173]:
display(df1)
display(df2)
display(df1.reindex(columns=df2.columns, fill_value=0))
display(df1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [174]:
df2.reindex(columns=df1.columns, fill_value=0)

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   5.0   NaN   7.0   8.0
2  10.0  11.0  12.0  13.0
3  15.0  16.0  17.0  18.0

In [175]:
display(df1)
display(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [176]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

### Operations between DataFrame and Series

In [177]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [178]:
arr[0]

array([0., 1., 2., 3.])

In [179]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [180]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [181]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [182]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [183]:
series2 = pd.Series(range(3), index=['b','e','f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [184]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [185]:
display(frame)
display(series3)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [186]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

In [187]:
mu = 1000
sigma = 3.
mu + sigma * np.random.standard_normal((4, 3))

array([[ 999.38266989,  997.14121468,  995.14077434],
       [ 999.97095224,  999.35157923, 1001.24551586],
       [ 999.59135908, 1000.66033608,  998.15846207],
       [1003.66630152,  995.17357781, 1001.81727515]])

In [188]:
frame = pd.DataFrame(np.random.standard_normal((4,3)),
                    columns=list("bde"),
                    index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    0.290367 -0.386843 -1.832866
Ohio    0.369727 -0.296216 -0.241426
Texas   0.944858  0.978828 -0.143647
Oregon  1.067525  0.051817  0.939188

In [189]:
np.abs(frame)

               b         d         e
Utah    0.290367  0.386843  1.832866
Ohio    0.369727  0.296216  0.241426
Texas   0.944858  0.978828  0.143647
Oregon  1.067525  0.051817  0.939188

In [190]:
frame["e"].max()

0.9391875370861617

In [191]:
def f1(x):
    return x.max()-x.min()

display(frame)
frame.apply(f1) # Opera sobre cada serie (por index)

               b         d         e
Utah    0.290367 -0.386843 -1.832866
Ohio    0.369727 -0.296216 -0.241426
Texas   0.944858  0.978828 -0.143647
Oregon  1.067525  0.051817  0.939188

b    0.777158
d    1.365671
e    2.772053
dtype: float64

In [192]:
frame.apply(f1, axis="columns") # Also by cols

Utah      2.123233
Ohio      0.665943
Texas     1.122474
Oregon    1.015709
dtype: float64

In [193]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min","max"])

In [194]:
display(frame)
frame.apply(f2)

               b         d         e
Utah    0.290367 -0.386843 -1.832866
Ohio    0.369727 -0.296216 -0.241426
Texas   0.944858  0.978828 -0.143647
Oregon  1.067525  0.051817  0.939188

            b         d         e
min  0.290367 -0.386843 -1.832866
max  1.067525  0.978828  0.939188

In [195]:
def my_format(x):
    return f"{x:.2f}"
display(frame)
frame.applymap(my_format) # Opera en cada elemento

               b         d         e
Utah    0.290367 -0.386843 -1.832866
Ohio    0.369727 -0.296216 -0.241426
Texas   0.944858  0.978828 -0.143647
Oregon  1.067525  0.051817  0.939188

           b      d      e
Utah    0.29  -0.39  -1.83
Ohio    0.37  -0.30  -0.24
Texas   0.94   0.98  -0.14
Oregon  1.07   0.05   0.94

In [196]:
frame["e"].map(my_format) # Para una columna

Utah      -1.83
Ohio      -0.24
Texas     -0.14
Oregon     0.94
Name: e, dtype: object

## Sorting and Ranking

In [197]:
# Series
obj = pd.Series(np.arange(4.), index=["d","a","b","c"])

In [198]:
obj

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [199]:
obj.sort_index() # indexes y su valor asociado

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [200]:
# DataFrames
obj = pd.DataFrame(np.arange(8).reshape(2,4), 
                  index=["three","one"],
                  columns=["d", "a", "b", "c"])

In [201]:
obj

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [202]:
obj.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [203]:
obj.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [204]:
obj.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [205]:
obj = pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [206]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [207]:
obj = pd.Series([4, np.NaN, 7, np.NaN, -3, 2])
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [208]:
obj = pd.Series([4, np.NaN, 7, np.NaN, -3, 2])
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [209]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [210]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [211]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [212]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [213]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [214]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [215]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [216]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [217]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [218]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [219]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [220]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [221]:
obj.index.is_unique

False

In [222]:
obj["a"]

a    0
a    1
dtype: int64

In [223]:
obj["c"]

4

In [224]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  1.896542 -1.783761  0.172249
a  0.691604  0.738507 -0.314141
b -0.014910  1.664327  1.388819
b  1.964856  0.017714  0.399114
c  1.388559  0.685155 -0.364851

In [225]:
df.loc["b"]

          0         1         2
b -0.014910  1.664327  1.388819
b  1.964856  0.017714  0.399114

In [226]:
df.loc["b"]

          0         1         2
b -0.014910  1.664327  1.388819
b  1.964856  0.017714  0.399114

## Summarizing and Computing Descriptive Statistics

In [227]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [228]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [229]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [230]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [231]:
display(df)
df.mean()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    3.083333
two   -2.900000
dtype: float64

In [232]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [233]:
df.idxmax()

one    b
two    d
dtype: object

In [234]:
df.idxmin()

one    d
two    b
dtype: object

In [235]:
display(df)
df.cumsum()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [236]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [237]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [238]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation an covariance

In [241]:
price = pd.read_pickle("/Users/enriquem.muro/PycharmProjects/pydata-book/examples/yahoo_price.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [242]:
volumen = pd.read_pickle("/Users/enriquem.muro/PycharmProjects/pydata-book/examples/yahoo_volume.pkl")
volumen

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [245]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [246]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [247]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151144

In [248]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [250]:
returns["MSFT"].cov(returns["IBM"])/(returns["MSFT"].std() * returns["IBM"].std())

0.4997636114415114

In [251]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [252]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [253]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [254]:
returns.corrwith(volumen)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [255]:
returns.corrwith(volumen, axis="columns")

Date
2010-01-04         NaN
2010-01-05    0.737298
2010-01-06    0.017069
2010-01-07    0.507614
2010-01-08   -0.779646
                ...
2016-10-17   -0.881606
2016-10-18   -0.303369
2016-10-19   -0.970723
2016-10-20   -0.304414
2016-10-21    0.927824
Length: 1714, dtype: float64

### Unique Values, Value Counts, and Membership

In [256]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [257]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [259]:
obj.value_counts()

3

In [264]:
pd.value_counts(obj.to_numpy(), sort=True, ascending=True)

d    1
b    2
c    3
a    3
dtype: int64

In [268]:
mask = obj.isin(["b","c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [269]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [273]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

unique_vals = pd.Series(["c", "b", "a"])

indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2])

In [275]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [277]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [281]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [283]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [284]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64